typeof undefined //"undefined"
typeof 1         //"number"
typeof true      // "boolean"
typeof "foo"     // "string"
typeof {}        // "object"
typeof []        // "object"
typeof null      // виведеться "object", але це помилка самого JS, бо null це окремий тип  
"1" + 2;         // Результат "12", Якщо хоча б один аргумент типу string, то бінарний "+" приведе другий аргумент до типу string
1 + "2";         // "12"
1 + "2" - 0;     // 12 так як у операції "+" та "-" пріорітети однакові, то операції відбуваються зліва направо
"1" - 0 + 2;     // 3
null == undefined; // true
null == 0;         // false null >= 0, але нулю не дорівнює
"a" > "b";         // false бо unicode 'а' менший за 'б' 
"a" > "A";         // true бо unicode 'а' більший за 'А'
!!a //(если a = 1 --------------------------------
    // если a = “1” ----------------------------------
    // если a = 0  ---------------------------------------- всюди буде true
    // если a = true ---------------------------------
    // если a = { b: 1 }) ------------------------

